saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/GigaDevice.GD32F3x0_DFP.1.0.1.pdsc
        <!-- *************************  Device 'GD32F350R6'  ***************************** -->
        <device Dname="GD32F350R6">
         <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F350R8'  ***************************** -->
        <device Dname="GD32F350R8">
         <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F350RB'  ***************************** -->
        <device Dname="GD32F350RB">
         <memory    id="IROM1"                   start="0x08000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F3x0.FLM" start="0x08000000" size="0x20000" default="1"/>
        </device>

      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="GD32F3x0">
      <description>GigaDevice GD32F3x0 Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F3[35]0*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="GD32F3x0 CMSIS">
      <description>GigaDevice GD32F3x0 Devices and CMSIS-CORE</description>
      <require condition="GD32F3x0"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GD32F3x0_libopt"/>    
      <require Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="RCU"/>           
    </condition>

    <!-- GD32F3x0 STDPERIPHERALS RCU Conditions -->
    <condition id="GD32F3x0 STDPERIPHERALS RCU">
      <description>GigaDevice  GD32F3x0 Standard Peripherals Drivers with RCU</description>
      <require condition="GD32F3x0 CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="RCU"/>
    </condition>

     <!-- GD32F3x0 STDPERIPHERALS MISC Conditions -->
    <condition id="GD32F3x0 STDPERIPHERALS MISC">
      <description>GigaDevice  GD32F3x0 Standard Peripherals Drivers with MISC</description>
      <require condition="GD32F3x0 CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="MISC"/>
    </condition>

     <!-- GD32F3x0 STDPERIPHERALS EVAL Conditions -->
    <condition id="GD32F3x0 STDPERIPHERALS EVAL">
      <description>GigaDevice  GD32F3x0 Standard Peripherals Drivers with EVAL</description>
      <require condition="GD32F3x0 CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="EXTI"/>
      <require Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="USART"/>
      <require Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="SYSCFG"/>
    </condition>
  </conditions>

  <components>
    <!-- GD32F3x0_StdPeripherals -->
    <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="ADC" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Analog-to-digital converter (ADC) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_adc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_adc.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="CRC" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_crc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_crc.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="CTC" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Clock trim controller (CTC) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CTC
        </RTE_Components_h>
        <files>
          <!-- CTC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_ctc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_ctc.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="DBG" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Debug (DBG) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DBG
        </RTE_Components_h>
        <files>
          <!-- MCUDBG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_dbg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_dbg.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="DMA" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Direct Memory Access (DMA) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_dma.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_dma.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="EXTI" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>External Interrupt/Event (EXTI) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXTI
        </RTE_Components_h>
        <files>
          <!-- EXTI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_exti.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_exti.c" attr="config" version="1.0.0" />
        </files>
    </component>

