saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/GigaDevice.GD32F3x0_DFP.1.0.1.pdsc
  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="CMP" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Comparator (CMP) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CMP
        </RTE_Components_h>
        <files>
          <!-- CMP flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_cmp.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_cmp.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F3x0_StdPeripherals" Csub="DAC" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS RCU">
      <description>Digital-to-analog converter (DAC) driver for GD32F3x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
        </RTE_Components_h>
        <files>
          <!-- DAC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f3x0_dac.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f3x0_dac.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <!-- Utilities GD32F3x0 -->
    <component Cclass="Device" Cgroup="GD32F3x0_EVAL" Cversion="1.0.0" condition="GD32F3x0 STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32f3x0_eval.h"/>
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32f3x0_eval.c" attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Config GD32F3x0 -->
    <component Cclass="Device" Cgroup="GD32F3x0_libopt" Cversion="1.0.0" condition="GD32F3x0 CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Include/gd32f3x0_libopt.h"/>
      </files>
    </component>

    <!-- Startup GD32F3x0 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="GD32F3x0 CMSIS">
      <description>System Startup for GigaDevice GD32F3x0 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32f3x0.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32f3x0.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32f3x0.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>
</package>
